Revit 2024 API
Hardwood Class
 A static class that provides access to the property names that appear in the Hardwood visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Hardwood
Visual Basic
Public NotInheritable Class Hardwood
Visual C++
public ref class Hardwood abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Hardwood
See Also
Hardwood Members
Autodesk.Revit.DB.Visual Namespace